/*/*3. Создать систему для учета документов.
Создать класс Регистр, который будет иметь методы:
- сохранения документа в регистре
- предоставление информации о документе
Система может работать с тремя типами документов:
- Класс регистр должен содержать внутри себя массив и при добавлении
документа в регистр этот добавляемый документ должен добавляться в
массив;
- Массив для класса регистра должен быть размером 10;*/


package Lesson7.HomeTask3;

public class Registr {

  void SavingDocuments() {

  }

  void DocumentInformation() {

  }

}
