//Составьте программу, выводящую на экран квадраты чисел от 10 до 20
//включительно.

package Lesson3.findsquareRoot;

public class FindSquareNumbers {
  public static void main(String[] args) {

    for (int i = 10; i <= 20; i++)
      System.out.println(i * i);
  }
}

